EDT/УТ/src/Documents/УчетПоездокМагистрали/УчетПоездокМагистрали.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УчетПоездокМагистрали</name>
  <registerRecords>AccumulationRegister.УчетПоездокМагистрали</registerRecords>
  <registerRecords>AccumulationRegister.СводПоЗарплате</registerRecords>
  <registerRecords>AccumulationRegister.мгЗарплатаНачисления</registerRecords>
  <attributes>
    <name>мгОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегионОтправления</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>РегионПрибытия</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатПоездки</name>
    <type>
      <types>EnumRef.РезультатыПоездкиМагистрали</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПоездки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>мгНачисление</name>
    <type>
      <types>CatalogRef.мгНачисленияУдержания</types>
    </type>
  </attributes>
  <attributes>
    <name>мгКомментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>мгОтветственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

EDT/УТ/src/AccumulationRegisters/УчетПоездокМагистрали/УчетПоездокМагистрали.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УчетПоездокМагистрали</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ПоездкаСорвана</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоездкаВыполнена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>РегионОтправления</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РегионПрибытия</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/AccumulationRegisters/СводПоЗарплате/СводПоЗарплате.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СводПоЗарплате</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказательКоличества</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЮрЛицо</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРасчетаЗарплаты</name>
    <type>
      <types>EnumRef.ТипыРасчетаЗарплаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УчастникЭкипажа</name>
    <type>
      <types>EnumRef.УчастникЭкипажа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.ПоказателиРасчетаУслугСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипНУ</name>
    <type>
      <types>EnumRef.ТипыНУЭкипажей</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/AccumulationRegisters/мгЗарплатаНачисления/мгЗарплатаНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>мгЗарплатаНачисления</name>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидНачисления</name>
    <type>
      <types>CatalogRef.мгНачисленияУдержания</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/Enums/РезультатыПоездкиМагистрали/РезультатыПоездкиМагистрали.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РезультатыПоездкиМагистрали</name>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Сорвана</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Enums/УчастникЭкипажа/УчастникЭкипажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УчастникЭкипажа</name>
  <enumValues>
    <name>Водитель</name>
  </enumValues>
  <enumValues>
    <name>Экспедитор</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Enums/ТипыРасчетаЗарплаты/ТипыРасчетаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРасчетаЗарплаты</name>
  <enumValues>
    <name>СдельныйРасчетПоДоставкам</name>
  </enumValues>
  <enumValues>
    <name>РасчетПоОкладу</name>
  </enumValues>
  <enumValues>
    <name>НочныеСмены</name>
  </enumValues>
  <enumValues>
    <name>Магистраль</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Enums/ТипыНУЭкипажей/ТипыНУЭкипажей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНУЭкипажей</name>
  <enumValues>
    <name>Начисление</name>
  </enumValues>
  <enumValues>
    <name>Удержание</name>
  </enumValues>
  <enumValues>
    <name>РасчетЗП</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/УчетПоездокМагистрали/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// РН УчетПоездокМагистрали
	Движения.УчетПоездокМагистрали.Записывать = Истина;
	Движения.УчетПоездокМагистрали.Очистить();
	
	Движение = Движения.УчетПоездокМагистрали.Добавить();
	Движение.Период = Дата;
	Движение.Регистратор = ЭтотОбъект.Ссылка;
	Движение.РегионОтправления = РегионОтправления;
	Движение.РегионПрибытия = РегионПрибытия;
	Движение.Транспорт = Транспорт;
	Движение.Водитель = Водитель;
	
	Движение.ПоездкаВыполнена = 0;
	Движение.ПоездкаСорвана = 0;	
	Если ЭтотОбъект.РезультатПоездки = Перечисления.РезультатыПоездкиМагистрали.Выполнена Тогда	
		Движение.ПоездкаВыполнена = 1;
	ИначеЕсли ЭтотОбъект.РезультатПоездки = Перечисления.РезультатыПоездкиМагистрали.Сорвана Тогда	
		Движение.ПоездкаСорвана = 1;	
	КонецЕсли;
	
	
	
	// РН СводПоЗарплате
	Движения.СводПоЗарплате.Записывать = Истина;
	Движения.СводПоЗарплате.Очистить();
	
	Если ЭтотОбъект.РезультатПоездки = Перечисления.РезультатыПоездкиМагистрали.Выполнена Тогда
		
		Движение = Движения.СводПоЗарплате.Добавить();
		Движение.Период = Дата;	
		Движение.Регистратор = ЭтотОбъект.Ссылка;
		Движение.ПоказательКоличества = 1;
		Движение.Сумма = Тариф;
		Движение.Регион = РегионПрибытия;
		Движение.УчастникЭкипажа = Перечисления.УчастникЭкипажа.Водитель;
		Движение.ФизЛицо = Водитель;
		Движение.ТипРасчетаЗарплаты = Перечисления.ТипыРасчетаЗарплаты.Магистраль;
		//Движение.ЮрЛицо = ;
		Движение.ТипНУ = Перечисления.ТипыНУЭкипажей.Начисление;
		Движение.Услуга = Справочники.ПоказателиРасчетаУслугСД.ОсновнаяЧасть;
	
	КонецЕсли;
	
	// Миго-групп ШушлебинДА {
	// 05.06.2017 движения по регистру мгУчетЗарплаты
	Движения.мгЗарплатаНачисления.Записывать = Истина;
	Движения.мгЗарплатаНачисления.Очистить();
	Если ЭтотОбъект.РезультатПоездки = ПредопределенноеЗначение("Перечисление.РезультатыПоездкиМагистрали.Выполнена") Тогда
		Движение = Движения.мгЗарплатаНачисления.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		//Движение.Период = ДатаОкончанияПоездки;
		Движение.Период = Дата;
		Движение.Организация = мгОрганизация;
		Движение.Терминал = РегионОтправления;
		Движение.ВидНачисления = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.МагистральСПБ");
		Движение.Сотрудник = Водитель;
		Движение.Тариф = Тариф;
	КонецЕсли;
	//} ШушлебинДА
		
КонецПроцедуры
